Revit 2027 API
AirCoolingCoilType Enumeration
 The type of air cooling coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AirCoolingCoilType
Public Enumeration AirCoolingCoilType
public enum class AirCoolingCoilType
type AirCoolingCoilType
Members
Member name | Value | Description
ChilledWater | 1
DirectExpansion | 2
None | 0
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace